# #14 - Junção de DataFrames

In [1]:
import numpy as np
import pandas as pd

In [2]:
dados = np.arange(1, 10).reshape(3,3)

In [3]:
dados

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [4]:
df1 = pd.DataFrame(dados, columns='A B C'.split())
df2 = pd.DataFrame(dados, columns='A B C'.split())
df3 = pd.DataFrame(dados, columns='D E F'.split())

In [5]:
df1

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
df2

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
df3

   D  E  F
0  1  2  3
1  4  5  6
2  7  8  9

### Concat

In [10]:
pd.concat([df1, df2], ignore_index=True)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9
3  1  2  3
4  4  5  6
5  7  8  9

In [12]:
pd.concat([df1, df3], axis=1)

   A  B  C  D  E  F
0  1  2  3  1  2  3
1  4  5  6  4  5  6
2  7  8  9  7  8  9

In [14]:
pd.concat([df1, df2, df3], ignore_index=True)

     A    B    C    D    E    F
0  1.0  2.0  3.0  NaN  NaN  NaN
1  4.0  5.0  6.0  NaN  NaN  NaN
2  7.0  8.0  9.0  NaN  NaN  NaN
3  1.0  2.0  3.0  NaN  NaN  NaN
4  4.0  5.0  6.0  NaN  NaN  NaN
5  7.0  8.0  9.0  NaN  NaN  NaN
6  NaN  NaN  NaN  1.0  2.0  3.0
7  NaN  NaN  NaN  4.0  5.0  6.0
8  NaN  NaN  NaN  7.0  8.0  9.0

### Merge

In [20]:
df1 = pd.DataFrame(dados, columns='A B C'.split())
df2 = pd.DataFrame(dados, columns='D B C'.split())

In [21]:
df1

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [22]:
df2

   D  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
pd.merge(df1, df2, on=['B', 'C'])

   A  B  C  D
0  1  2  3  1
1  4  5  6  4
2  7  8  9  7

### Join

In [24]:
df1 = pd.DataFrame(dados, columns='A B C'.split(), index=[0, 1, 2])
df2 = pd.DataFrame(dados, columns='D E F'.split(), index=[1, 2, 3])

In [25]:
df1

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [26]:
df2

   D  E  F
1  1  2  3
2  4  5  6
3  7  8  9

In [29]:
df1.join(df2, how='outer')

     A    B    C    D    E    F
0  1.0  2.0  3.0  NaN  NaN  NaN
1  4.0  5.0  6.0  1.0  2.0  3.0
2  7.0  8.0  9.0  4.0  5.0  6.0
3  NaN  NaN  NaN  7.0  8.0  9.0